src/Reports/ОтчётПоТочкеЗаказа/ОтчётПоТочкеЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоТочкеЗаказа</name>
  <attributes>
    <name>РасходЗаПериод</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстаткиНаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ДоговорныеПозиции/ДоговорныеПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговорныеПозиции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстатокПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорнаяПозиция</name>
    <type>
      <types>CatalogRef.ДоговорныеПозиции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыМПЗ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>EnumRef.СтатусыМПЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПерспективныеПланы/ПерспективныеПланы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПерспективныеПланы</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезПриб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезКм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КрупныеЗаказы/КрупныеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КрупныеЗаказы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаПоступленияКомплектации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРезерва</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ЗаказыНаПроизводство/ЗаказыНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыНаПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ИзготовлениеПечатныхПлат/ИзготовлениеПечатныхПлат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзготовлениеПечатныхПлат</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФайлИзготовления</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/ОтчётПоТочкеЗаказа/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ДобавитьМПЗ(МПЗ)
	Если ПолучитьСтатус(МПЗ,ТекущаяДата()) = Перечисления.СтатусыМПЗ.Запрещённая Тогда	
	Возврат;
	КонецЕсли; 
		Если СписокГруппПоЗакупкам.Количество() > 0 Тогда	
			Если НеПринадлежатВыбраннымГруппам Тогда
				Если СписокГруппПоЗакупкам.НайтиПоЗначению(МПЗ.ГруппаПоЗакупкам) <> Неопределено Тогда	
				Возврат;
				КонецЕсли; 
			Иначе	
				Если СписокГруппПоЗакупкам.НайтиПоЗначению(МПЗ.ГруппаПоЗакупкам) = Неопределено Тогда	
				Возврат;
				КонецЕсли; 		
			КонецЕсли; 	
		КонецЕсли; 
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорныеПозицииСрезПоследних.Количество,
	|	ДоговорныеПозицииСрезПоследних.ОстатокПоДоговору,
	|	ДоговорныеПозицииСрезПоследних.ДоговорнаяПозиция.Владелец.Владелец КАК Поставщик
	|ИЗ
	|	РегистрСведений.ДоговорныеПозиции.СрезПоследних КАК ДоговорныеПозицииСрезПоследних
	|ГДЕ
	|	ДоговорныеПозицииСрезПоследних.ДоговорнаяПозиция.МПЗ = &МПЗ";
	Если Не Договор.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ДоговорныеПозицииСрезПоследних.ДоговорнаяПозиция.Владелец = &Договор"; 
	Запрос.УстановитьПараметр("Договор", Договор);
	ИначеЕсли Не Поставщик.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ДоговорныеПозицииСрезПоследних.ДоговорнаяПозиция.Владелец.Владелец = &Поставщик"; 
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	КонецЕсли; 
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если (Не Поставщик.Пустая())или(Не Договор.Пустая()) Тогда
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Возврат;
		КонецЕсли; 
	КонецЕсли; 
ТЧ = ТаблицаМПЗ.Добавить();
ТЧ.МПЗ = МПЗ;
ТЧ.ГруппаМПЗ = МПЗ.Родитель;
ТЧ.ГруппаПоЗакупкам = МПЗ.ГруппаПоЗакупкам;	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ.КоличествоПоДоговору = ТЧ.КоличествоПоДоговору + ВыборкаДетальныеЗаписи.Количество;
	ТЧ.ОстатокПоДоговору = ТЧ.ОстатокПоДоговору + ВыборкаДетальныеЗаписи.ОстатокПоДоговору;
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналогиНормРасходов.Ссылка КАК Ссылка,
	|	АналогиНормРасходов.Элемент КАК Элемент
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АналогиНормРасходов КАК АналогиНормРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|			ПО (СтатусыМПЗСрезПоследних.МПЗ = АналогиНормРасходов.Владелец.Владелец)
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = АналогиНормРасходов.Владелец
	|ГДЕ
	|	АналогиНормРасходов.Владелец.Элемент = &Элемент
	|	И НормыРасходовСрезПоследних.Норма > 0
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус";
Запрос.УстановитьПараметр("Элемент", МПЗ);
Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НормыАНР = ОбщегоНазначенияПовтИсп.АналогиНормРасходов_ПолучитьПоследнее(ВыборкаДетальныеЗаписи.Ссылка,ТекущаяДата());
		Если НормыАНР.Норма > 0 Тогда
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
				Если ТаблицаАналоговМПЗ.НайтиСтроки(Новый Структура("МПЗ,АналогМПЗ",МПЗ,ВыборкаДетальныеЗаписи.Элемент)).Количество() = 0 Тогда	
				ТЧ = ТаблицаАналоговМПЗ.Добавить();
				ТЧ.МПЗ = МПЗ;
				ТЧ.АналогМПЗ = ВыборкаДетальныеЗаписи.Элемент;					
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
		Для каждого ТЧ Из МПЗ.Аналоги Цикл
			Если ТаблицаАналоговМПЗ.НайтиСтроки(Новый Структура("МПЗ,АналогМПЗ",МПЗ,ТЧ.Аналог)).Количество() = 0 Тогда	
			ТЧ_ТАМ = ТаблицаАналоговМПЗ.Добавить();
			ТЧ_ТАМ.МПЗ = МПЗ;
			ТЧ_ТАМ.АналогМПЗ = ТЧ.Аналог;					
			КонецЕсли;
		КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура СоздатьСписокМПЗ()
ТаблицаМПЗ.Очистить();
ТаблицаАналоговМПЗ.Очистить();
СписокМПЗ.Очистить();
	Если СписокГруппМПЗ.Количество() > 0 Тогда
		Для каждого Стр Из СписокГруппМПЗ Цикл
			Если Стр.Значение.ЭтоГруппа Тогда
			Выборка = Справочники.Материалы.ВыбратьИерархически(Стр.Значение);
				Пока Выборка.Следующий() Цикл	
					Если Не Выборка.ЭтоГруппа Тогда	
					ДобавитьМПЗ(Выборка.Ссылка);
					КонецЕсли; 
				КонецЦикла;
			Иначе	
			ДобавитьМПЗ(Стр.Значение);
			КонецЕсли; 	
		КонецЦикла; 	
	Иначе	
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорныеПозиции.МПЗ
		|ИЗ
		|	Справочник.ДоговорныеПозиции КАК ДоговорныеПозиции
		|ГДЕ
		|	ДоговорныеПозиции.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Договор);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДобавитьМПЗ(ВыборкаДетальныеЗаписи.МПЗ);
		КонецЦикла; 
	КонецЕсли;
ТаблицаМПЗ.Сортировать("ГруппаМПЗ,ГруппаПоЗакупкам,МПЗ");
ТаблицаАналоговМПЗ.Сортировать("МПЗ,АналогМПЗ");
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
	
	СписокМПЗ.Добавить(ТЧ.МПЗ);
	КонецЦикла; 
		Для каждого ТЧ Из ТаблицаАналоговМПЗ Цикл
			Если СписокМПЗ.НайтиПоЗначению(ТЧ.АналогМПЗ) = Неопределено Тогда
			СписокМПЗ.Добавить(ТЧ.АналогМПЗ);			
			КонецЕсли; 
		КонецЦикла;
СписокМПЗ.СортироватьПоЗначению();
КонецПроцедуры

&НаСервере
Процедура ПодсчётРасходаПоВсемСкладам()
ТаблицаРасходаМПЗ.Очистить();
ТаблицаРасходаДокументы.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОбороты.МПЗ КАК МПЗ,
	|	МестаХраненияОбороты.Регистратор,
	|	МестаХраненияОбороты.КоличествоРасход
	|ИЗ
	|	РегистрНакопления.МестаХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК МестаХраненияОбороты
	|ГДЕ
	|	МестаХраненияОбороты.МПЗ В(&СписокМПЗ)
	|ИТОГИ ПО
	|	МПЗ";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.РасходЗаПериод.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.РасходЗаПериод.ДатаОкончания));
Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМПЗ.Следующий() Цикл
	ТЧ = ТаблицаРасходаМПЗ.Добавить();
	ТЧ.МПЗ = ВыборкаМПЗ.МПЗ;
	ВыборкаДетальныеЗаписи = ВыборкаМПЗ.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПередачаВПроизводство") Тогда	
			ТЧ.КоличествоРасход = ТЧ.КоличествоРасход + ВыборкаДетальныеЗаписи.КоличествоРасход;
			ТЧ_Док = ТаблицаРасходаДокументы.Добавить();
			ТЧ_Док.МПЗ = ВыборкаМПЗ.МПЗ;
			ТЧ_Док.Документ = ВыборкаДетальныеЗаписи.Регистратор;
			ТЧ_Док.Количество = ВыборкаДетальныеЗаписи.КоличествоРасход;
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СписаниеМПЗПрочее") Тогда
				Если ВыборкаДетальныеЗаписи.Регистратор.Статья.ПринадлежитЭлементу(ГруппаСтатейСписанияНаИнвентаризацию) Тогда
				ТЧ.КоличествоСписание = ТЧ.КоличествоСписание + ВыборкаДетальныеЗаписи.КоличествоРасход;
				ТЧ_Док = ТаблицаРасходаДокументы.Добавить();
				ТЧ_Док.МПЗ = ВыборкаМПЗ.МПЗ;				
				ТЧ_Док.Документ = ВыборкаДетальныеЗаписи.Регистратор;
				ТЧ_Док.Количество = ВыборкаДетальныеЗаписи.КоличествоРасход;
				Иначе
					Если ВыборкаДетальныеЗаписи.Регистратор.Статья = СтатьяСписанияНаРеализацию Тогда
					ТЧ.КоличествоРеализация = ТЧ.КоличествоРеализация + ВыборкаДетальныеЗаписи.КоличествоРасход;
					ТЧ_Док = ТаблицаРасходаДокументы.Добавить();
					ТЧ_Док.МПЗ = ВыборкаМПЗ.МПЗ;
					ТЧ_Док.Документ = ВыборкаДетальныеЗаписи.Регистратор;
					ТЧ_Док.СписаниеНаРеализацию = Истина;
					ТЧ_Док.Количество = ВыборкаДетальныеЗаписи.КоличествоРасход;
					Иначе	
					ТЧ.КоличествоСписание = ТЧ.КоличествоСписание + ВыборкаДетальныеЗаписи.КоличествоРасход;
					ТЧ_Док = ТаблицаРасходаДокументы.Добавить();
					ТЧ_Док.МПЗ = ВыборкаМПЗ.МПЗ;
					ТЧ_Док.Документ = ВыборкаДетальныеЗаписи.Регистратор;
					ТЧ_Док.Количество = ВыборкаДетальныеЗаписи.КоличествоРасход;
					КонецЕсли; 
				КонецЕсли; 	
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.Реализация") Тогда	
			ТЧ.КоличествоРеализация = ТЧ.КоличествоРеализация + ВыборкаДетальныеЗаписи.КоличествоРасход;
			ТЧ_Док = ТаблицаРасходаДокументы.Добавить();
			ТЧ_Док.МПЗ = ВыборкаМПЗ.МПЗ;
			ТЧ_Док.Документ = ВыборкаДетальныеЗаписи.Регистратор;
			ТЧ_Док.Количество = ВыборкаДетальныеЗаписи.КоличествоРасход;
			КонецЕсли; 	
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодсчётОстатковПоВыбраннымСкладам()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОстатки.МПЗ,
	|	МестаХраненияОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.МестаХранения.Остатки(&НаДату, ) КАК МестаХраненияОстатки
	|ГДЕ
	|	МестаХраненияОстатки.МестоХранения В ИЕРАРХИИ(&СписокМестХранения)
	|	И МестаХраненияОстатки.МПЗ В(&СписокМПЗ)";
Запрос.УстановитьПараметр("НаДату", КонецДня(Отчет.ОстаткиНаДату));
Запрос.УстановитьПараметр("СписокМестХранения", СписокМестХранения);
Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Выборка = ТаблицаРасходаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ВыборкаДетальныеЗаписи.МПЗ)); 
		Если Выборка.Количество() = 0 Тогда			
		ТЧ = ТаблицаРасходаМПЗ.Добавить();
		ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;
		ТЧ.КоличествоОстаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Иначе
		Выборка[0].КоличествоОстаток = Выборка[0].КоличествоОстаток + ВыборкаДетальныеЗаписи.КоличествоОстаток;
		КонецЕсли; 	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗВсюСпецификацию(ЭтапСпецификации,КолУзла)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент,
	|	НормыРасходовСрезПоследних.Норма,
	|	НормыРасходов.Ссылка,
	|	НормыРасходов.ВидЭлемента
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходов.Владелец = &Владелец
	|	И (ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Номенклатура)
	|			ИЛИ ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Материалы))
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНР = РезультатЗапроса.Выбрать();
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы")Тогда
		РаскрытьНаМПЗВсюСпецификацию(ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);
			Если СписокМПЗ.НайтиПоЗначению(ВыборкаНР.Элемент) = Неопределено Тогда	
			Продолжить;				
			КонецЕсли; 
		Выборка = ТаблицаРасходаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ВыборкаНР.Элемент)); 
			Если Выборка.Количество() = 0 Тогда			
			ТЧ = ТаблицаРасходаМПЗ.Добавить();
			ТЧ.МПЗ = ВыборкаНР.Элемент;
			ТЧ.КоличествоРК = ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
			Иначе
			Выборка[0].КоличествоРК = Выборка[0].КоличествоРК + ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
			КонецЕсли;					
		ИначеЕсли ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Номенклатура")Тогда
		РаскрытьНаМПЗВсюСпецификацию(ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);				
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодсчётРезервКомплектов()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПерспективныеПланы.МПЗ,
	|	ПерспективныеПланы.РезКм
	|ИЗ
	|	РегистрСведений.ПерспективныеПланы КАК ПерспективныеПланы
	|ГДЕ
	|	ПерспективныеПланы.Период = &НаДату
	|	И ПерспективныеПланы.РезКм > 0";
Запрос.УстановитьПараметр("НаДату", НачалоМесяца(ТекущаяДата()));
	Если СписокГруппНоменклатуры.Количество()> 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ПерспективныеПланы.МПЗ В ИЕРАРХИИ(&СписокГруппНоменклатуры)";
	Запрос.УстановитьПараметр("СписокГруппНоменклатуры", СписокГруппНоменклатуры);
	КонецЕсли; 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	РаскрытьНаМПЗВсюСпецификацию(ВыборкаДетальныеЗаписи.МПЗ,ВыборкаДетальныеЗаписи.РезКм);
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	КрупныеЗаказы.Продукция КАК Продукция,
	|	КрупныеЗаказы.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.КрупныеЗаказы КАК КрупныеЗаказы
	|ГДЕ
	|	КрупныеЗаказы.Обработан = ЛОЖЬ
	|	И КрупныеЗаказы.ДатаРезерва <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	Если СписокГруппНоменклатуры.Количество()> 0 Тогда
	Запрос.Текст = Запрос.Текст + " И КрупныеЗаказы.Продукция В ИЕРАРХИИ(&СписокГруппНоменклатуры)";
	Запрос.УстановитьПараметр("СписокГруппНоменклатуры", СписокГруппНоменклатуры);
	КонецЕсли; 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	РаскрытьНаМПЗВсюСпецификацию(ВыборкаДетальныеЗаписи.Продукция,ВыборкаДетальныеЗаписи.Количество);
	КонецЦикла;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыНаПроизводствоОстатки.Документ КАК Документ,
	|	ЗаказыНаПроизводствоОстатки.Продукция КАК Продукция,
	|	ЗаказыНаПроизводствоОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПроизводство.Остатки КАК ЗаказыНаПроизводствоОстатки";
	Если СписокГруппНоменклатуры.Количество()> 0 Тогда
	Запрос.Текст = Запрос.Текст + " ГДЕ ЗаказыНаПроизводствоОстатки.Продукция В ИЕРАРХИИ(&СписокГруппНоменклатуры)";
	Запрос.УстановитьПараметр("СписокГруппНоменклатуры", СписокГруппНоменклатуры);
	КонецЕсли;	
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Продукция = ВыборкаДетальныеЗаписи.Продукция;
		Для каждого ТЧ_Заказ Из ВыборкаДетальныеЗаписи.Документ.Заказ Цикл	
			Если ТЧ_Заказ.Продукция = Продукция Тогда
				Если ТЧ_Заказ.РучнойЗапуск = 0 Тогда
					Если ТЧ_Заказ.КрупныйЗаказ Тогда
					КоличествоНеСоздано = ТЧ_Заказ.Количество - ПолучитьКоличествоСозданых(ВыборкаДетальныеЗаписи.Документ,Продукция);
						Если КоличествоНеСоздано > 0 Тогда
						РаскрытьНаМПЗВсюСпецификацию(Продукция,КоличествоНеСоздано);
						КонецЕсли;	
					КонецЕсли;  
				КонецЕсли; 	
			Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьГербер(МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзготовлениеПечатныхПлат.ФайлИзготовления
	|ИЗ
	|	РегистрСведений.ИзготовлениеПечатныхПлат КАК ИзготовлениеПечатныхПлат
	|ГДЕ
	|	ИзготовлениеПечатныхПлат.МПЗ = &МПЗ
	|	И ИзготовлениеПечатныхПлат.Действующий = ИСТИНА
	|	И ИзготовлениеПечатныхПлат.ФайлИзготовления.ВидДокумента = &ВидДокумента";
Запрос.УстановитьПараметр("ВидДокумента", Перечисления.ВидыДокументов.Гербер);
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(СокрЛП(ВыборкаДетальныеЗаписи.ФайлИзготовления.Наименование));
	КонецЦикла;
Возврат("");
КонецФункции

&НаСервере
Функция ПолучитьКоличествоОстатокАналогов(МПЗ)
КоличествоОстаток = 0;
ВыборкаАналогиМПЗ = ТаблицаАналоговМПЗ.НайтиСтроки(Новый Структура("МПЗ",МПЗ));
	Для к = 0 по ВыборкаАналогиМПЗ.Количество()-1 Цикл
		Если ВыборкаАналогиМПЗ[к].АналогМПЗ.ГруппаПоЗакупкам = Перечисления.ГруппыПоЗакупкам.ПустаяСсылка() Тогда	
		Выборка = ТаблицаРасходаМПЗ.НайтиСтроки(Новый Структура("МПЗ", ВыборкаАналогиМПЗ[к].АналогМПЗ));
			Если Выборка.Количество() > 0 Тогда
			КоличествоОстаток = КоличествоОстаток + (Выборка[0].КоличествоОстаток - Выборка[0].КоличествоРК);
			КонецЕсли;		
		КонецЕсли;  
	КонецЦикла;
Возврат(КоличествоОстаток);
КонецФункции

&НаСервере
Процедура РаскрытьНаМПЗ(Линейка,ЭтапСпецификации,КолУзла)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент,
	|	НормыРасходовСрезПоследних.Норма,
	|	НормыРасходов.Ссылка,
	|	НормыРасходов.ВидЭлемента
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходов.Владелец = &Владелец
	|	И (ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Номенклатура)
	|			ИЛИ ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Материалы))
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНР = РезультатЗапроса.Выбрать();
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы")Тогда
			Если СписокМПЗ.НайтиПоЗначению(ВыборкаНР.Элемент) = Неопределено Тогда	
			Продолжить;				
			КонецЕсли; 
		Выборка = ТаблицаРасходаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ВыборкаНР.Элемент));
			Если Выборка.Количество() = 0 Тогда			
			ТЧ = ТаблицаРасходаМПЗ.Добавить();
			ТЧ.МПЗ = ВыборкаНР.Элемент;
			ТЧ.КоличествоОжидаемыйРасход = ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
			ТЧ_Лин = ТЧ.ТаблицаРасходаПоЛинейкам.Добавить();
			ТЧ_Лин.Линейка = Линейка;
			ТЧ_Лин.Количество = ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;	
			Иначе
			ВыборкаЛин = Выборка[0].ТаблицаРасходаПоЛинейкам.НайтиСтроки(Новый Структура("Линейка",Линейка));
				Если ВыборкаЛин.Количество() = 0 Тогда
				ТЧ_Лин = Выборка[0].ТаблицаРасходаПоЛинейкам.Добавить();
				ТЧ_Лин.Линейка = Линейка;
				ТЧ_Лин.Количество = ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;					
				Иначе	
				ВыборкаЛин[0].Количество = ВыборкаЛин[0].Количество + ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
				КонецЕсли; 
			Выборка[0].КоличествоОжидаемыйРасход = Выборка[0].КоличествоОжидаемыйРасход + ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла;
			КонецЕсли;
		РаскрытьНаМПЗ(Линейка,ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла); 					
		ИначеЕсли ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Номенклатура")Тогда
			Если ВыборкаНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор Тогда
			РаскрытьНаМПЗ(Линейка,ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла); 
			ИначеЕсли ВыборкаНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
			РаскрытьНаМПЗ(Линейка,ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла); 
			Иначе
				Если ВыборкаНР.Элемент.Канбан.Пустая() Тогда
				РаскрытьНаМПЗ(Линейка,ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);				
				КонецЕсли; 				
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодсчётОжидаемогоРасхода()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Линейка,
	|	ПроизводственноеЗадание.Изделие,
	|	ПроизводственноеЗадание.Количество КАК Количество
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДатаЗапуска = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ПроизводственноеЗадание.Подразделение В(&СписокПодразделений)
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ПроизводственноеЗадание.Линейка,
	|	ПроизводственноеЗадание.Изделие";
Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЛинейка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЛинейка.Следующий() Цикл
	ВыборкаИзделие = ВыборкаЛинейка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИзделие.Следующий() Цикл
		РаскрытьНаМПЗ(ВыборкаЛинейка.Линейка,ВыборкаИзделие.Изделие,ВыборкаИзделие.Количество);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
ТабДок.Очистить();

	Если СоздатьЗаявкуНаЗакупку Тогда
	Заявка = Документы.ЗаявкаНаЗакупку.СоздатьДокумент();
	Заявка.Автор = ПараметрыСеанса.Пользователь;
	Заявка.Дата = ТекущаяДата();
	Заявка.Подразделение = СписокПодразделений[0].Значение;
	Заявка.УстановитьНовыйНомер(ПрисвоитьПрефикс(Заявка.Подразделение));
	Заявка.Комментарий = СписокГруппМПЗ;
	КонецЕсли; 

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблГруппа = Макет.ПолучитьОбласть("Группа");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблЗаказ = Макет.ПолучитьОбласть("Заказ");
ОблАналог = Макет.ПолучитьОбласть("Аналог");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.РасходЗаПериод.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.РасходЗаПериод.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.НаДату = Формат(Отчет.ОстаткиНаДату,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.МестаХранения = СписокМестХранения;
	Если СписокГруппПоЗакупкам.Количество() > 0 Тогда
		Если НеПринадлежатВыбраннымГруппам Тогда		
		ОблШапка.Параметры.ПринадлежностьГруппе = "Не принадлежат группам по закупкам "+СписокГруппПоЗакупкам;
		Иначе
		ОблШапка.Параметры.ПринадлежностьГруппе = "Принадлежат группам по закупкам "+СписокГруппПоЗакупкам;
		КонецЕсли; 
	Иначе
	ОблШапка.Параметры.ПринадлежностьГруппе = "Принадлежат любым группам по закупкам";	
	КонецЕсли;  
ОблШапка.Параметры.Поставщик = Поставщик;
ОблШапка.Параметры.Договор = Договор;
ОблШапка.Параметры.ДатаВывода = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

КолДней = (Отчет.РасходЗаПериод.ДатаОкончания-Отчет.РасходЗаПериод.ДатаНачала)/86400;

// Запрос по заказам поставщикам
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.МПЗ,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, ) КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.МПЗ В(&СписокМПЗ)";
	Если СписокПодразделенийЗаказов.Количество() > 0 Тогда
		Если ИсключитьПодразделения Тогда
		Запрос.Текст = Запрос.Текст + " И НЕ ЗаказыПоставщикамОстатки.ЗаказПоставщику.Подразделение В(&СписокПодразделений)";
		Иначе	
		Запрос.Текст = Запрос.Текст + " И ЗаказыПоставщикамОстатки.ЗаказПоставщику.Подразделение В(&СписокПодразделений)";		
		КонецЕсли;	
	Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделенийЗаказов);
	КонецЕсли; 
Запрос.УстановитьПараметр("НаДату", Отчет.ОстаткиНаДату);
Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
	Если Не Поставщик.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ЗаказыПоставщикамОстатки.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Поставщик);	
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " ИТОГИ СУММА(КоличествоОстаток) ПО МПЗ,ЗаказПоставщику";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаЗаказыПоставщикамМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

//Формирование таблицы отчёта
ТекГруппаМПЗ = Неопределено;
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
		Если ТекГруппаМПЗ <> ТЧ.ГруппаМПЗ Тогда
		ТекГруппаМПЗ = ТЧ.ГруппаМПЗ;
		ОблГруппа.Параметры.ГруппаМПЗ = ТекГруппаМПЗ;
		ТабДок.Вывести(ОблГруппа);
		КонецЕсли;
	ОблМПЗ.Параметры.Статус = ПолучитьСтатус(ТЧ.МПЗ);
	ОблМПЗ.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование); 
	ОблМПЗ.Параметры.МПЗ = ТЧ.МПЗ;
	ОблМПЗ.Параметры.PartNumber = СокрЛП(ТЧ.МПЗ.PartNumber);
	ОблМПЗ.Параметры.ГруппаПоЗакупкам = ТЧ.МПЗ.ГруппаПоЗакупкам;
	ОблМПЗ.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.МПЗ.ЕдиницаИзмерения.Наименование);
	ОблМПЗ.Параметры.МинОстаток = ТЧ.МПЗ.МинОстаток;
	ОблМПЗ.Параметры.КратностьУпаковки = ТЧ.МПЗ.КратностьУпаковки;
	ОблМПЗ.Параметры.СрокПоставки = ТЧ.МПЗ.СрокПоставки; 
	ОблМПЗ.Параметры.СтраховойЗапас = ТЧ.МПЗ.СтраховойЗапас;
	ОблМПЗ.Параметры.ТочкаЗаказа = ТЧ.МПЗ.ТочкаЗаказа;
	ПроцентКТочкеЗаказа = ТЧ.МПЗ.ТочкаЗаказа/100*ПроцентКТЗ;
	ОблМПЗ.Параметры.ПроцентКТочкеЗаказа = ПроцентКТочкеЗаказа;
	ОблМПЗ.Параметры.МаксимальныйЗапас = ТЧ.МПЗ.МаксимальныйЗапас;
	ОблМПЗ.Параметры.КоличествоКЗаказу = ТЧ.МПЗ.КоличествоКЗаказу;
	ОблМПЗ.Параметры.ОстатокПоДоговору = ТЧ.ОстатокПоДоговору;
	ОблМПЗ.Параметры.Гербер = ПолучитьГербер(ТЧ.МПЗ); 
	Выборка = ТаблицаРасходаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ТЧ.МПЗ));
		Если Выборка.Количество() > 0 Тогда
		ОблМПЗ.Параметры.КоличествоРасход = Выборка[0].КоличествоРасход;
		ОблМПЗ.Параметры.КоличествоСписание = Выборка[0].КоличествоСписание;
		ОблМПЗ.Параметры.КоличествоРеализация = Выборка[0].КоличествоРеализация;
		ОблМПЗ.Параметры.КоличествоОстаток = Выборка[0].КоличествоОстаток - Выборка[0].КоличествоРК - Выборка[0].КоличествоОжидаемыйРасход;
		ОблМПЗ.Параметры.КоличествоРК = Выборка[0].КоличествоРК;
		ОблМПЗ.Параметры.КоличествоОжидаемыйРасход = Выборка[0].КоличествоОжидаемыйРасход;
		Иначе	
		ОблМПЗ.Параметры.КоличествоРасход = 0;
		ОблМПЗ.Параметры.КоличествоСписание = 0;
		ОблМПЗ.Параметры.КоличествоРеализация = 0;
		ОблМПЗ.Параметры.КоличествоОстаток = 0;
		ОблМПЗ.Параметры.КоличествоРК = 0;
		ОблМПЗ.Параметры.КоличествоОжидаемыйРасход = 0;		
		КонецЕсли;
	Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ.МПЗ));
	ОблМПЗ.Параметры.Цена = Формат(Цены.Цена,"ЧЦ=15; ЧДЦ=2; ЧРД=-");
	ВыборкаЗаказыПоставщикамМПЗ.Сбросить();
	ОблМПЗ.Параметры.Долг = 0;
		Пока ВыборкаЗаказыПоставщикамМПЗ.НайтиСледующий(Новый Структура("МПЗ",ТЧ.МПЗ)) Цикл
		ОблМПЗ.Параметры.Долг = ОблМПЗ.Параметры.Долг + ВыборкаЗаказыПоставщикамМПЗ.КоличествоОстаток; 
		КонецЦикла;
	Заказать = "-";
		Если ОблМПЗ.Параметры.Долг = 0 Тогда
			Если (ОблМПЗ.Параметры.КоличествоОстаток <= (ОблМПЗ.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
				 (ОблМПЗ.Параметры.КоличествоОстаток > ОблМПЗ.Параметры.СтраховойЗапас) Тогда	
			Заказать = ОблМПЗ.Параметры.КоличествоКЗаказу;
			ИначеЕсли (ОблМПЗ.Параметры.КоличествоОстаток <= (ОблМПЗ.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
				 	  (ОблМПЗ.Параметры.КоличествоОстаток <= ОблМПЗ.Параметры.СтраховойЗапас) Тогда	
			Заказать = ОблМПЗ.Параметры.КоличествоКЗаказу;
			КонецЕсли; 
		Иначе	
			Если (ОблМПЗ.Параметры.КоличествоОстаток <= (ОблМПЗ.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
				 (ОблМПЗ.Параметры.КоличествоОстаток > ОблМПЗ.Параметры.СтраховойЗапас) Тогда	
			Заказать = 0;
			ИначеЕсли (ОблМПЗ.Параметры.КоличествоОстаток <= (ОблМПЗ.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
				 	  (ОблМПЗ.Параметры.КоличествоОстаток <= ОблМПЗ.Параметры.СтраховойЗапас) Тогда	
			Заказать = ОблМПЗ.Параметры.КоличествоКЗаказу;			
			КонецЕсли;		
		КонецЕсли;
			Если ОблМПЗ.Параметры.СтраховойЗапас > (ОблМПЗ.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа) Тогда				
			Заказать = "-";
			КонецЕсли;  
	ОблМПЗ.Параметры.Заказать = Заказать;   
	ТекОбл = ТабДок.Вывести(ОблМПЗ);
		Если (ОблМПЗ.Параметры.КоличествоОстаток <= (ОблМПЗ.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
			 (ОблМПЗ.Параметры.КоличествоОстаток > ОблМПЗ.Параметры.СтраховойЗапас) Тогда	
		ТабДок.Область(ТекОбл.Верх, 16, ТекОбл.Низ, 16).ЦветФона = WebЦвета.Желтый;
		ИначеЕсли (ОблМПЗ.Параметры.КоличествоОстаток <= (ОблМПЗ.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
			 	  (ОблМПЗ.Параметры.КоличествоОстаток <= ОблМПЗ.Параметры.СтраховойЗапас) Тогда	
		ТабДок.Область(ТекОбл.Верх, 16, ТекОбл.Низ, 16).ЦветФона = WebЦвета.Красный;			
		КонецЕсли;
			Если ОблМПЗ.Параметры.СтраховойЗапас > (ОблМПЗ.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа) Тогда				
			ТабДок.Область(ТекОбл.Верх, 16, ТекОбл.Низ, 16).ЦветФона = WebЦвета.Синий;
			КонецЕсли; 		
				Если СоздатьЗаявкуНаЗакупку Тогда
					Если ОблМПЗ.Параметры.Заказать <> "-" Тогда
						Если ОблМПЗ.Параметры.Заказать > 0 Тогда
					    ТЧ_Заявка = Заявка.ТабличнаяЧасть.Добавить();
						ТЧ_Заявка.МПЗ = ТЧ.МПЗ;
						ТЧ_Заявка.Количество = ОблМПЗ.Параметры.Заказать;
						ТЧ_Заявка.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуИзмеренияПоБазовой(ТЧ.МПЗ);
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;  
	ВыборкаЗаказыПоставщикамМПЗ.Сбросить();
		Если ВыборкаЗаказыПоставщикамМПЗ.НайтиСледующий(Новый Структура("МПЗ",ТЧ.МПЗ)) Тогда
		ВыборкаДетальныеЗаписи = ВыборкаЗаказыПоставщикамМПЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.КоличествоОстаток > 0 Тогда
				ОблЗаказ.Параметры.Документ = ВыборкаДетальныеЗаписи.ЗаказПоставщику;
				ОблЗаказ.Параметры.ДатаИсполнения = Формат(ВыборкаДетальныеЗаписи.ЗаказПоставщику.ДатаИсполнения,"ДФ=dd.MM.yyyy"); 
				ОблЗаказ.Параметры.Долг = ВыборкаДетальныеЗаписи.КоличествоОстаток; 
	            ТабДок.Вывести(ОблЗаказ);				
				КонецЕсли; 				
		    КонецЦикла;
		КонецЕсли;
	//Аналоги МПЗ
	ВыборкаАналогиМПЗ = ТаблицаАналоговМПЗ.НайтиСтроки(Новый Структура("МПЗ",ТЧ.МПЗ));
		Для к = 0 по ВыборкаАналогиМПЗ.Количество()-1 Цикл
		АналогМПЗ = ВыборкаАналогиМПЗ[к].АналогМПЗ;
		ОблАналог.Параметры.Статус = ПолучитьСтатус(АналогМПЗ);
		ОблАналог.Параметры.Наименование = СокрЛП(АналогМПЗ.Наименование); 
		ОблАналог.Параметры.МПЗ = АналогМПЗ;
		ОблАналог.Параметры.PartNumber = СокрЛП(АналогМПЗ.PartNumber);
		ОблАналог.Параметры.ГруппаПоЗакупкам = АналогМПЗ.ГруппаПоЗакупкам;
		ОблАналог.Параметры.ЕдиницаИзмерения = СокрЛП(АналогМПЗ.ЕдиницаИзмерения.Наименование);
		ОблАналог.Параметры.МинОстаток = АналогМПЗ.МинОстаток;
		ОблАналог.Параметры.КратностьУпаковки = АналогМПЗ.КратностьУпаковки;
		ОблАналог.Параметры.СрокПоставки = АналогМПЗ.СрокПоставки; 
		ОблАналог.Параметры.СтраховойЗапас = АналогМПЗ.СтраховойЗапас;
		ОблАналог.Параметры.ТочкаЗаказа = АналогМПЗ.ТочкаЗаказа;
		ПроцентКТочкеЗаказа = АналогМПЗ.ТочкаЗаказа/100*ПроцентКТЗ;
		ОблАналог.Параметры.ПроцентКТочкеЗаказа = ПроцентКТочкеЗаказа;
		ОблАналог.Параметры.МаксимальныйЗапас = АналогМПЗ.МаксимальныйЗапас;
		ОблАналог.Параметры.КоличествоКЗаказу = АналогМПЗ.КоличествоКЗаказу;
		Выборка = ТаблицаРасходаМПЗ.НайтиСтроки(Новый Структура("МПЗ",АналогМПЗ));
			Если Выборка.Количество() > 0 Тогда
			ОблАналог.Параметры.КоличествоРасход = Выборка[0].КоличествоРасход;
			ОблАналог.Параметры.КоличествоСписание = Выборка[0].КоличествоСписание;
			ОблАналог.Параметры.КоличествоРеализация = Выборка[0].КоличествоРеализация;
			ОблАналог.Параметры.КоличествоОстаток = Выборка[0].КоличествоОстаток - Выборка[0].КоличествоРК - Выборка[0].КоличествоОжидаемыйРасход;
			ОблАналог.Параметры.КоличествоРК = Выборка[0].КоличествоРК;
			ОблАналог.Параметры.КоличествоОжидаемыйРасход = Выборка[0].КоличествоОжидаемыйРасход;
			Иначе	
			ОблАналог.Параметры.КоличествоРасход = 0;
			ОблАналог.Параметры.КоличествоСписание = 0;
			ОблАналог.Параметры.КоличествоРеализация = 0;
			ОблАналог.Параметры.КоличествоОстаток = 0;	
			ОблАналог.Параметры.КоличествоРК = 0;
			ОблАналог.Параметры.КоличествоОжидаемыйРасход = 0;	
			КонецЕсли;
		Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",АналогМПЗ));
		ОблАналог.Параметры.Цена = Цены.Цена;
		ВыборкаЗаказыПоставщикамМПЗ.Сбросить();
		ОблАналог.Параметры.Долг = 0;
			Пока ВыборкаЗаказыПоставщикамМПЗ.НайтиСледующий(Новый Структура("МПЗ",АналогМПЗ)) Цикл
			ОблАналог.Параметры.Долг = ОблАналог.Параметры.Долг + ВыборкаЗаказыПоставщикамМПЗ.КоличествоОстаток; 
			КонецЦикла;
		Заказать = "-";
			Если ОблАналог.Параметры.Долг = 0 Тогда
				Если (ОблАналог.Параметры.КоличествоОстаток <= (ОблАналог.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
					 (ОблАналог.Параметры.КоличествоОстаток > ОблАналог.Параметры.СтраховойЗапас) Тогда	
				Заказать = ОблАналог.Параметры.КоличествоКЗаказу;
				ИначеЕсли (ОблАналог.Параметры.КоличествоОстаток <= (ОблАналог.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
					 	  (ОблАналог.Параметры.КоличествоОстаток <= ОблАналог.Параметры.СтраховойЗапас) Тогда	
				Заказать = ОблАналог.Параметры.КоличествоКЗаказу;
				КонецЕсли; 
			Иначе	
				Если (ОблАналог.Параметры.КоличествоОстаток <= (ОблАналог.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
					 (ОблАналог.Параметры.КоличествоОстаток > ОблАналог.Параметры.СтраховойЗапас) Тогда	
				Заказать = 0;
				ИначеЕсли (ОблАналог.Параметры.КоличествоОстаток <= (ОблАналог.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
					 	  (ОблАналог.Параметры.КоличествоОстаток <= ОблАналог.Параметры.СтраховойЗапас) Тогда	
				Заказать = ОблАналог.Параметры.КоличествоКЗаказу;			
				КонецЕсли;		
			КонецЕсли; 
				Если ОблАналог.Параметры.СтраховойЗапас > (ОблАналог.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа) Тогда				
				Заказать = "-";
				КонецЕсли;   
		ОблАналог.Параметры.Заказать = Заказать;
		ТекОбл = ТабДок.Вывести(ОблАналог);
			Если (ОблАналог.Параметры.КоличествоОстаток <= (ОблАналог.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
				 (ОблАналог.Параметры.КоличествоОстаток > ОблАналог.Параметры.СтраховойЗапас) Тогда	
			ТабДок.Область(ТекОбл.Верх, 16, ТекОбл.Низ, 16).ЦветФона = WebЦвета.Желтый;
			ИначеЕсли (ОблАналог.Параметры.КоличествоОстаток <= (ОблАналог.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа))и
				 	  (ОблАналог.Параметры.КоличествоОстаток <= ОблАналог.Параметры.СтраховойЗапас) Тогда	
			ТабДок.Область(ТекОбл.Верх, 16, ТекОбл.Низ, 16).ЦветФона = WebЦвета.Красный;			
			КонецЕсли;
				Если ОблАналог.Параметры.СтраховойЗапас > (ОблАналог.Параметры.ТочкаЗаказа + ПроцентКТочкеЗаказа) Тогда				
				ТабДок.Область(ТекОбл.Верх, 16, ТекОбл.Низ, 16).ЦветФона = WebЦвета.Синий;
				КонецЕсли;
		ВыборкаЗаказыПоставщикамМПЗ.Сбросить();
			Если ВыборкаЗаказыПоставщикамМПЗ.НайтиСледующий(Новый Структура("МПЗ",АналогМПЗ)) Тогда
			ВыборкаДетальныеЗаписи = ВыборкаЗаказыПоставщикамМПЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.КоличествоОстаток > 0 Тогда
					ОблЗаказ.Параметры.Документ = ВыборкаДетальныеЗаписи.ЗаказПоставщику;
					ОблЗаказ.Параметры.ДатаИсполнения = Формат(ВыборкаДетальныеЗаписи.ЗаказПоставщику.ДатаИсполнения,"ДФ=dd.MM.yyyy"); 
					ОблЗаказ.Параметры.Долг = ВыборкаДетальныеЗаписи.КоличествоОстаток; 
	            	ТабДок.Вывести(ОблЗаказ);				
					КонецЕсли;
			    КонецЦикла;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 6;
	Если СоздатьЗаявкуНаЗакупку Тогда
		Если Заявка.ТабличнаяЧасть.Количество() > 0 Тогда
		Заявка.Записать(РежимЗаписиДокумента.Запись);
		Возврат(Заявка.Ссылка);		
		КонецЕсли;
	КонецЕсли;
Возврат(Неопределено); 
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Создание списка МПЗ и их аналогов...");
	СоздатьСписокМПЗ();
	Состояние("Обработка...",,"Подсчёт расхода по всем складам...");
	ПодсчётРасходаПоВсемСкладам();
	Состояние("Обработка...",,"Подсчёт ожидаемого расхода...");
	ПодсчётОжидаемогоРасхода();
	Состояние("Обработка...",,"Подсчёт остатков по выбранным складам...");
	ПодсчётОстатковПоВыбраннымСкладам(); 
		Если ПолучитьРезервКомплектов Тогда	
		Состояние("Обработка...",,"Подсчёт резерв комплектов по перспективному плану...");
		ПодсчётРезервКомплектов();		
		КонецЕсли; 
	Состояние("Обработка...",,"Создание таблицы отчёта...");
	Результат = СформироватьНаСервере();
		Если СоздатьЗаявкуНаЗакупку Тогда
			Если Результат <> Неопределено Тогда
			ОткрытьФорму("Документ.ЗаявкаНаЗакупку.ФормаОбъекта",Новый Структура("Ключ",Результат));
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
ПоставщикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоставщикПриИзмененииНаСервере()
Договор = Поставщик.ОсновнойДоговор;
КонецПроцедуры

&НаСервере
Функция ВывестиРасшифровкуПоДокументам(ВидДокумента,Расшифровка)
ТД = Новый ТабличныйДокумент;
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("РасшифровкаПоДокументам");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблДокумент = Макет.ПолучитьОбласть("Документ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.РасходЗаПериод.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.РасходЗаПериод.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.МПЗ = Расшифровка;
	Если ВидДокумента = 1 Тогда
	ОблШапка.Параметры.ВидДокумента = "Передачи в производство";
	ИначеЕсли ВидДокумента = 2 Тогда
	ОблШапка.Параметры.ВидДокумента = "Списания МПЗ прочие";
	ИначеЕсли ВидДокумента = 3 Тогда
	ОблШапка.Параметры.ВидДокумента = "Списания на реализацию";
	КонецЕсли;
ТД.Вывести(ОблШапка);
КоличествоВсего = 0;
	Для каждого ТЧ Из ТаблицаРасходаДокументы Цикл	
		Если ТЧ.МПЗ = Расшифровка Тогда
			Если ВидДокумента = 1 Тогда	
				Если ТипЗнч(ТЧ.Документ) = Тип("ДокументСсылка.ПередачаВПроизводство") Тогда
				ОблДокумент.Параметры.Документ = ТЧ.Документ;
				ОблДокумент.Параметры.Количество = ТЧ.Количество;
				ОблДокумент.Параметры.ЕдиницаИзмерения = СокрЛП(Расшифровка.ЕдиницаИзмерения.Наименование);
				ТД.Вывести(ОблДокумент);
				КоличествоВсего = КоличествоВсего + ТЧ.Количество;
				КонецЕсли; 
			ИначеЕсли ВидДокумента = 2 Тогда	
				Если ТипЗнч(ТЧ.Документ) = Тип("ДокументСсылка.СписаниеМПЗПрочее") Тогда
					Если Не ТЧ.СписаниеНаРеализацию Тогда
					ОблДокумент.Параметры.Документ = ТЧ.Документ;
					ОблДокумент.Параметры.Количество = ТЧ.Количество;
					ОблДокумент.Параметры.ЕдиницаИзмерения = СокрЛП(Расшифровка.ЕдиницаИзмерения.Наименование);
					ТД.Вывести(ОблДокумент);
					КоличествоВсего = КоличествоВсего + ТЧ.Количество;					
					КонецЕсли; 
				КонецЕсли; 
			ИначеЕсли ВидДокумента = 3 Тогда	
				Если ТипЗнч(ТЧ.Документ) = Тип("ДокументСсылка.СписаниеМПЗПрочее") Тогда
					Если ТЧ.СписаниеНаРеализацию Тогда
					ОблДокумент.Параметры.Документ = ТЧ.Документ;
					ОблДокумент.Параметры.Количество = ТЧ.Количество;
					ОблДокумент.Параметры.ЕдиницаИзмерения = СокрЛП(Расшифровка.ЕдиницаИзмерения.Наименование);
					ТД.Вывести(ОблДокумент);
					КоличествоВсего = КоличествоВсего + ТЧ.Количество;					
					КонецЕсли; 
				ИначеЕсли ТипЗнч(ТЧ.Документ) = Тип("ДокументСсылка.Реализация") Тогда
				ОблДокумент.Параметры.Документ = ТЧ.Документ;
				ОблДокумент.Параметры.Количество = ТЧ.Количество;
				ОблДокумент.Параметры.ЕдиницаИзмерения = СокрЛП(Расшифровка.ЕдиницаИзмерения.Наименование);
				ТД.Вывести(ОблДокумент);
				КоличествоВсего = КоличествоВсего + ТЧ.Количество;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
ОблКонец.Параметры.КоличествоВсего = КоличествоВсего;
ТД.Вывести(ОблКонец);
ТД.Защита = Истина;
ТД.ФиксацияСверху = 3; 
Возврат(ТД);
КонецФункции

&НаСервере
Функция ВывестиОжидаемыйРасходПоЛинейкам(Расшифровка)
Расшифровка.Сортировать("Линейка");
ТД = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("ОжидаемыйРасходПоЛинейкам");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблЛинейка = Макет.ПолучитьОбласть("Линейка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ТД.Вывести(ОблШапка);
КоличествоВсего = 0;
	Для каждого ТЧ Из Расшифровка Цикл	
	ОблЛинейка.Параметры.Линейка = ТЧ.Линейка;
	ОблЛинейка.Параметры.Количество = ТЧ.Количество;
	ТД.Вывести(ОблЛинейка);
	КоличествоВсего = КоличествоВсего + ТЧ.Количество; 
	КонецЦикла;
ОблКонец.Параметры.КоличествоВсего = КоличествоВсего;
ТД.Вывести(ОблКонец);
ТД.Защита = Истина;
ТД.ФиксацияСверху = 3; 
Возврат(ТД);
КонецФункции

&НаСервере
Функция ВывестиРасходНаПроизводство(Расшифровка)
Запрос = Новый Запрос;
ТД = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("РасшифровкаПоРасходуНаПроизводство");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМестоХранения = Макет.ПолучитьОбласть("МестоХранения");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.МПЗ = Расшифровка;
ТД.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаХраненияОбороты.МестоХранения КАК МестоХранения,
	|	МестаХраненияОбороты.КоличествоРасход КАК КоличествоРасход,
	|	МестаХраненияОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.МестаХранения.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК МестаХраненияОбороты
	|ГДЕ
	|	МестаХраненияОбороты.МПЗ = &МПЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестоХранения
	|ИТОГИ
	|	СУММА(КоличествоРасход)
	|ПО
	|	МестоХранения";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.РасходЗаПериод.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.РасходЗаПериод.ДатаОкончания));
Запрос.УстановитьПараметр("МПЗ", Расшифровка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМестоХранения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КоличествоВсего = 0;
	Пока ВыборкаМестоХранения.Следующий() Цикл
	КоличествоМХ = 0;
	ВыборкаДетальныеЗаписи = ВыборкаМестоХранения.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.ПередачаВПроизводство") Тогда	
			КоличествоМХ = КоличествоМХ + ВыборкаДетальныеЗаписи.КоличествоРасход;
			КоличествоВсего = КоличествоВсего + ВыборкаДетальныеЗаписи.КоличествоРасход;
			КонецЕсли;	
		КонецЦикла;
			Если КоличествоМХ > 0 Тогда
			ОблМестоХранения.Параметры.МестоХранения = ВыборкаМестоХранения.МестоХранения;
			ОблМестоХранения.Параметры.Количество = КоличествоМХ;
			ОблМестоХранения.Параметры.ЕдиницаИзмерения = СокрЛП(Расшифровка.ЕдиницаИзмерения.Наименование);
			ТД.Вывести(ОблМестоХранения);
			КонецЕсли; 
	КонецЦикла;	
ОблКонец.Параметры.КоличествоВсего = КоличествоВсего;
ТД.Вывести(ОблКонец);
ТД.Защита = Истина;
ТД.ФиксацияСверху = 3; 
Возврат(ТД);
КонецФункции

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
ИмяКолонки = СокрЛП(Сред(Элемент.ТекущаяОбласть.Имя,Найти(Элемент.ТекущаяОбласть.Имя,"C")));
НомерКолонки = Число(Сред(ИмяКолонки,2));
	Если НомерКолонки = 11 Тогда
	СтандартнаяОбработка = Ложь;
	ТД = ВывестиРасходНаПроизводство(Расшифровка);
	ТД.Показать("Расход на производство по местам хранения");
	ИначеЕсли НомерКолонки = 12 Тогда
	СтандартнаяОбработка = Ложь;
	ТД = ВывестиРасшифровкуПоДокументам(2,Расшифровка);
	ТД.Показать("Расшифровка по списаниям");
	ИначеЕсли НомерКолонки = 13 Тогда
	СтандартнаяОбработка = Ложь;
	ТД = ВывестиРасшифровкуПоДокументам(3,Расшифровка);
	ТД.Показать("Расшифровка по реализациям");
	ИначеЕсли НомерКолонки = 16 Тогда
		Если ТипЗнч(Расшифровка) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		СтандартнаяОбработка = Ложь;
		ИмяОтчета = "ОтчётПоРегиструМестаХранения";
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,Отчет.ОстаткиНаДату,Отчет.ОстаткиНаДату,Новый Структура("МПЗ,МестоХранения",Расшифровка,СписокМестХранения),"ОстаткиПоСкладам"));
		ПараметрыФормы.Вставить("КлючВарианта","ОстаткиПоСкладам"); 
		ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);		
		КонецЕсли;
	ИначеЕсли НомерКолонки = 17 Тогда
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("МПЗ",Расшифровка);
		Если Не Поставщик.Пустая() Тогда	
		Отбор.Вставить("Контрагент",Поставщик);
		КонецЕсли;
			Если Не Договор.Пустая() Тогда	
			Отбор.Вставить("Договор",Договор);
			КонецЕсли; 
	ИмяОтчета = "ОтчётПоРегиструЗаказыПоставщикам";
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,НачалоГода(ТекущаяДата()),ТекущаяДата(),Отбор,"ПоПоставщикамВРазрезеЗаказов"));
	ПараметрыФормы.Вставить("КлючВарианта","ПоПоставщикамВРазрезеЗаказов"); 
	ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);
	ИначеЕсли НомерКолонки = 18 Тогда
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("МПЗ",Расшифровка);
		Если Не Поставщик.Пустая() Тогда	
		Отбор.Вставить("Контрагент",КонтрагентДляЗаявокОтПокупателей);
		КонецЕсли; 
	ИмяОтчета = "ОтчётПоРегиструЗаявкиОтПокупателей";
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,НачалоГода(ТекущаяДата()),ТекущаяДата(),Отбор,"ПоЗаявкам"));
	ПараметрыФормы.Вставить("КлючВарианта","ПоЗаявкам"); 
	ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);	 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.ОстаткиНаДату = ТекущаяДата();
Отчет.РасходЗаПериод.ДатаНачала = ТекущаяДата()-21*86400;
Отчет.РасходЗаПериод.ДатаОкончания = ТекущаяДата();
КонецПроцедуры
